{
  "courses": [
    {
      "slug": "computer_basics",
      "icon": "fa-solid fa-computer",
      "language": "Βασικές Έννοιες Υπολογιστών",
      "header": "Βασικές Έννοιες Υπολογιστών",
      "description": "Πριν να μάθεις προγραμματισμό, πρέπει να γνωρίσεις καλύτερα τον υπολογιστή σου και βασικές έννοιες γύρο από αυτόν."
    },
    {
      "slug": "programming_basics",
      "icon": "fa-solid fa-code",
      "language": "Βασικές Έννοιες Προγραμματισμού",
      "header": "Βασικές Έννοιες Προγραμματισμού",
      "description": "Ας γνωρίσουμε καλύτερα μερικές βασικές έννοιες που θα χρειαστούν στον προγραμματισμού."
    },
    {
      "slug": "code_editors",
      "icon": "fa-solid fa-laptop-code",
      "language": "Προγράμματα Επεξεργασίας Κώδικα",
      "header": "Προγράμματα Επεξεργασίας Κώδικα",
      "description": "Για να προγραμματίσεις χρειάζεσαι ένα πρόγραμμα επεξεργασίας κώδικα. Ας δούμε τι είναι και πια είναι τα πιο δημοφιλή."
    },
    {
      "slug": "html",
      "icon": "fa-brands fa-html5",
      "language": "HTML",
      "header": "Κατασκευή Ιστοσελίδων",
      "description": "Η HTML είναι μια γλώσσα ανάπτυξης ιστοσελίδων στην οποία δημιουργείς το βασικό “σκελετό”\n  μίας ιστοσελίδας. Με αυτή εισάγεις μόνο κείμενο, πίνακες και λίστες.\n  Για οποιαδήποτε μορφοποίηση θέλεις να εφαρμόσεις χρειάζεται την CSS."
    },
    {
      "slug": "css",
      "icon": "fa-brands fa-css3",
      "language": "CSS",
      "header": "Κατασκευή Ιστοσελίδων",
      "description": "Η CSS είναι μια γλώσσα υπολογιστή που ανήκει στην κατηγορία των\n  γλωσσών σχεδιασμού και χρησιμοποιείται για τον έλεγχο της εμφάνισης ενός html εγγράφου.\n  Με την CSS ελέγχουμε το πως θα εμφανίζονται τα όσα έχουμε ορίσει στην HTML, έχοντας\n  την δυνατότητα να αλλάξουμε μέγεθος, χρώμα, φωτεινότητα, περίγραμμα, κ.α."
    },
    {
      "slug": "js",
      "icon": "fa-brands fa-js",
      "language": "Javascript",
      "header": "Γλώσσα Προγραμματισμού για Κατασκευή Ιστοσελίδων",
      "description": "Η JS είναι μια γλώσσα προγραμματισμού για δημιουργία ιστοσελίδων η οποία\n  \"συνεργάζεται\" με την HTML και την CSS για ένα πολύ όμορφο αποτέλεσμα.\n  Με την Javascript σου δίνετε η δυνατότητα να κάνεις την ιστοσελίδα\n  σου διαδραστική, με πολλαπλές λειτουργίες και εφαρμογές."
    },
    {
      "slug": "python",
      "icon": "fa-brands fa-python",
      "language": "Python",
      "header": "Γλώσσα Προγραμματισμού για Βασικές Έννοιες Προγραμματισμού",
      "description": "Η Python είναι μια γλώσσα προγραμματισμού που είναι φιλική για αρχάριους!\n  Σε αυτά τα μαθήματα θα γνωρίσετε μερικές βασικές έννοιες του προγραμματισμού\n  όπως οι μεταβλητές, οι πράξεις, οι λίστες, κ.α.\n  Αυτά τα μαθήματα ενδείκνυνται για αρχάριους προγραμματιστές και ως μία εισαγωγή στον προγραμματισμό."
    },
    {
      "slug": "arduino",
      "icon": "fa-solid fa-microchip",
      "language": "Arduino",
      "header": "Ρομποτική",
      "description": "Η Arduino είναι μια εταιρία που κατασκευάζει μικροελεγτές όπως το Arduino Uno,\n  και την γλώσσα προγραμματισμού Arduino, η οποία χρησιμοποιείτε για να\n  προγραμματίσουμε έναν μικροελεγκτή. Τα μαθήματα Arduino προορίζονται για άτομα\n  που θέλουν να εξελίξουν τις γνώσεις τους και στον τομέα του Hardware αλλά και στου Software.\n  Τα arduino συνδυάζουν αυτά τα δύο πεδία και παράλληλα είναι πολύ φιλικά προς τους αρχάριους.\n  Στο τέλος αυτής της σειράς θα ξέρεις να ελέγχεις με αυτό αισθητήρες, LEDs, μηχανές , κ.α."
    },
    {
      "slug": "git_and_github",
      "icon": "fa-brands fa-git-alt",
      "language": "Git και GitHub",
      "header": "Git και GitHub",
      "description": "Το Git είναι ένα σύστημα διαχείρισης εκδόσεων που χρησιμοποιείται για την\n  αποθήκευση και την διαχείριση των αρχείων ενός έργου. Το GitHub είναι μια\n  πλατφόρμα στην οποία μπορείς να αποθηκεύσεις τα αρχεία σου και να τα\n  μοιραστείς με άλλους. Σε αυτά τα μαθήματα θα μάθεις τι είναι το Git και το GitHub\n  και πως να τα χρησιμοποιήσεις."
    }
  ]
}