{
  "data": [
    {
      "slug": "lesson_1",
      "title": "Βασική δομή της HTML",
      "description": "Μέσα από αυτό το μάθημα θα αρχίσει το ταξίδι στην html μαθαίνοντας πως να ξεκινάς ένα αρχείο html αλλά και πως να γράφεις σχόλια μέσα στον κωδικά σου."
    },
    {
      "slug": "lesson_2",
      "title": "Head",
      "description": "Σε αυτό το μάθημα θα μάθεις για το τι στοιχεία υπάρχουν μέσα στο head element και τον σκοπό που εξυπηρετούν."
    },
    {
      "slug": "lesson_3",
      "title": "Body",
      "description": "Σε αυτό το μάθημα θα μάθεις για τα τους τίτλους και την παραγράφους."
    },
    {
      "slug": "lesson_4",
      "title": "Μορφοποίηση κειμένου HTML",
      "description": "Αφού φτιάξεις μία παράγραφό πως την μορφοποιηείς? Σε αυτό το μάθημα θα μάθεις ακριβώς αυτό, πως θα κάνεις το κείμενο έντονο, πλάγιο, κτλ."
    },
    {
      "slug": "lesson_5",
      "title": "Dividers",
      "description": "Σε αυτό το μάθημα θα μάθεις για το πως χωρίζουμε σε κομμάτια τον κώδικά μας αλλά και το πως τους δίνουμε μοναδικά id's για να μας είναι πιο εύκολο να τα αναγνωρίσουμε και αλλά και να τα μορφοποιήσουμε μέσω της css."
    },
    {
      "slug": "lesson_6",
      "title": "Πολυμέσα",
      "description": "Για να κάνεις την ιστοσελίδα σου πιο ενδιαφέρουσα αλλά και όμορφη μάθε πως να βάλεις σε αυτή βιντεο, εικόνες αλλά και ήχο σε αυτό το μάθημα."
    },
    {
      "slug": "lesson_7",
      "title": "Λίστες & Πίνακες",
      "description": "Ο τίτλος τα λέει όλα. Εδώ θα μάθεις το πως να φτιάξεις πίνακες αλλά και λίστες ώστε να φαίνονται όλα λίγο πιο οργανωμένα."
    },
    {
      "slug": "lesson_8",
      "title": "Φόρμες",
      "description": "Θα ήθελες να φτιάξεις μία φορμα μόνο με html? Λίγο δύσκολο, αλλά σήγουρα μπορείς να μάθεις πως να εισάγεις τα στοιχείς που θα χρειαστείς (όπως πεδίο κειμένου, password, email,κτλ) ώστε αργότερα να την εξελήξεεις."
    },
    {
      "slug": "lesson_9",
      "title": "Extra",
      "description": "Σε αυτό το τελευταίο μάθημα της σειράς μας θα μάθεις για μερικά ακόμα στοιχεία για να κάνεις την ιστοσελίδα σου πιο όμορφη από ποτέ με χρωματιστά spinners αλλά και ιδιέταιρες progress-bars"
    }
  ]
}